<template>
  <section id="page__vacancy-params">
    <div class="container">
      <div class="vacancy py-5">
        <h3 class="vacancy__name" v-html="vacancy.name"></h3>
        <div class="vacancy__cities c-dark-grey mb-5" v-html="vacancy.cities"></div>
        <div class="vacancy__text" v-html="vacancy.text"></div>
      </div>
      <div class="link-back">
        <nuxt-link to="/">Вернуться назад</nuxt-link>
      </div>
    </div>
  </section>
</template>

<script type="text/javascript">
  import _ from 'lodash';

  export default {
    validate ({ params }) {
      return /^\d+$/.test(params.item);
    },

    data() {
      return {
        vacancy: {
          id: 1,
          name: '',
          cities: '',
          annotation: '',
          text: ''
        },
        vacancies: [
          {
            id: 1,
            name: 'C# разработчик',
            cities: 'Екатеринбург',
            annotation: '<p>В Точке многие процессы завязаны на CRM Microsoft Dynamics, поэтому нам всегда нужны разработчики, пишущие на шарпе. У нас – 20 скрам-команд: в каждой ты сможешь применить свои скиллы и выбрать задачи, интересные именно тебе. Присоединяйся к нам!</p>',
            text: '<p>В Точке многие процессы завязаны на CRM Microsoft Dynamics, поэтому нам всегда нужны разработчики, пишущие на шарпе. У нас – 20 скрам-команд: в каждой ты сможешь применить свои скиллы и выбрать задачи, интересные именно тебе. Присоединяйся к нам!</p><p>В работе мы используем: ASP.NET Web Api, WCF, MVC, MVVM, MS SQL, Oracle, Javascript. От тебя мы ждём умения не только кодить, но и писать юнит-тесты, и использовать системы контроля версий.</p><p>А ещё мы банк — поэтому для нас критично делать вещи правильно и без косяков. В конце концов, речь идёт о самом важном, что есть у наших клиентов — их деньгах :)</p><h3>Как мы работаем:</h3><ul><li>В продуктовых командах, у которых есть полная свобода в рамках своего домена и тематики. И всё это с минимумом зависимостей от окружающих;</li><li>Дружный молодой коллектив и позитивная атмосфера;</li><li>Без бюрократии: нет никаких передач ТЗ между отделами, затягивания сроков и перекладывания ответственности;</li><li>Стараемся релизиться как можно быстрее и сразу получать обратную связь от пользователей.</li></ul><h3>От нас:</h3><ul><li>Коллеги – эксперты, готовые помочь и поделиться опытом;</li><li>Уютный офис в центре Екатеринбурга в 5 минутах от метро Геологическая;</li><li>Непринуждённое общение с архитектором системы, если это нужно;</li><li>Возможность попробовать себя в любой из наших продуктовых команд — от разработки инфраструктуры и оценки рисков до расчёта налогов и работы с зарубежными контрагентами;</li><li>Работа над востребованным продуктом: десятки тысяч предпринимателей по всей стране будут использовать то, что ты сделал;</li><li>Зарплата выше среднерыночной;</li><li>В общем, мы не совсем банк, и работа в Точке — это скорее работа в продуктовой IT-компании, чем в серьёзном финансовом учреждении.</li></ul>'
          },
          {
            id: 2,
            name: 'Java-разработчик',
            cities: 'Екатеринбург',
            annotation: '<p>В Точке основной бэкенд и многие продуктовые сервисы написаны на Java. Мы растём и ищем Java-разработчика в нашу команду. Тебе предстоит решать множество задач — от написания маленьких тематических админок до больших финансовых бэкендов и нагруженных инфраструктурных сервисов.</p>',
            text: '<p>В Точке основной бэкенд и многие продуктовые сервисы написаны на Java. Мы растём и ищем Java-разработчика в нашу команду. Тебе предстоит решать множество задач — от написания маленьких тематических админок до больших финансовых бэкендов и нагруженных инфраструктурных сервисов.</p><p>А ещё мы банк — поэтому для нас критично делать вещи правильно и без косяков. В конце концов речь идёт о самом важном, что есть у наших клиентов — их деньгах.</p><h3>Ты нам подходишь, если:</h3><ul><li>Понимаешь Spring, Hibernate и JMS.</li><li>Знаком с устройством JVM и Maven.</li><li>Умеешь работать с разными базами данных – Oracle, PostrgreSQL, MySQL.</li><li>Мы готовы в новых сервисах использовать более модные мелкие фреймворки и хипстерские тулзы, но знать базовые вещи — обязательно :)</li></ul><h3>Как мы работаем:</h3><ul><li>Точка поделена на независимые команды. Каждая команда сама решает, как ей лучше работать и выполнять задачи.</li><li>У нас нет бюрократии: никаких передач ТЗ между отделами, затягивания сроков и перекладывания ответственности.</li><li>Стараемся выпускать релиз как можно быстрее и сразу получать обратную связь от пользователей.</li><li>В общем, мы не совсем банк, и работа в Точке — это скорее работа в продуктовой IT-компании, чем в серьёзном финансовом учреждении.</li></ul><h3>От нас:</h3><ul><li>Практически любое железо для оборудования рабочего места.</li><li>Возможность попробовать себя в любой из наших продуктовых команд — от инфраструктуры и оценки рисков до расчёта налогов и внешнеэкономической деятельности.</li><li>Работа над действительно востребованным продуктом: десятки тысяч предпринимателей по всей стране будут использовать то, что ты сделал.</li><li>Уютный офис в центре Екатеринбурга в 5 минутах от метро «Геологическая». Кальянная, бесплатные кофе-поинты, пинг-понг, дартс и многое другое.</li><li>Комфортная зарплата, которая оправдывает ожидания. Обсуждается индивидуально.</li></ul>'
          },
          {
            id: 3,
            name: 'Веб-разработчик (PHP c уклоном в Full Stack)',
            cities: 'Екатеринбург',
            annotation: '<p>В Точке разработчики пишут много сервисов для внутреннего использования и большинство из них пишутся на PHP без выделенных фронтендеров. Мы растём и нам нужно больше веб-разработчиков на PHP, которые любят Full Stack. В командах нет ограничений какие фреймворки и библиотеки они используют, поэтому если в твоём арсенале есть какие-то новые и крутые штуки — приходи, будем пробовать :)</p>',
            text: '<p>В Точке разработчики пишут много сервисов для внутреннего использования и большинство из них пишутся на PHP без выделенных фронтендеров. Мы растём и нам нужно больше веб-разработчиков на PHP, которые любят Full Stack. В командах нет ограничений какие фреймворки и библиотеки они используют, поэтому если в твоём арсенале есть какие-то новые и крутые штуки — приходи, будем пробовать :)</p><p>Ребята, которые занимаются такими проектами напрямую общаются с заказчиками и чаще других выступают в роли аналитиков. Они вникают в предметную область и формируют подходы к решениям поставленных задач. Если тебя это не пугает, то welcome!</p><p>А ещё мы банк — поэтому для нас критично делать вещи правильно и без косяков. В конце концов речь идёт о самом важном, что есть у наших клиентов — их деньгах :)</p><h3>Как мы работаем:</h3><ul><li>Работа в команде. Работа в продуктовых командах, которые обладают полной свободой в рамках своего домена или тематики и минимумом зависимостей от окружающих.</li><li>Без бюрократии. Нет никаких передач ТЗ между отделами, затягивания сроков и перекладывания ответственности.</li><li>Быстрый результат. Релиз происходит дважды в месяц, и мы сразу получаем реакцию живых пользователей.</li></ul><h3>От нас:</h3><ul><li>Практически любое железо для оборудования рабочего места.</li><li>Возможность попробовать себя в любой из наших продуктовых команд — от инфраструктуры и оценки рисков до расчёта налогов и внешнеэкономической деятельности.</li><li>Работа над действительно востребованным продуктом: десятки тысяч предпринимателей по всей стране будут использовать то, что ты сделал.</li><li>Уютный офис в центре Екатеринбурга в 5 минутах от метро «Геологическая». Кальянная, бесплатные кофе-поинты, пинг-понг, дартс и многое другое.</li><li>Комфортная зарплата, которая оправдывает ожидания. Обсуждается индивидуально.</li></ul>'
          },
          {
            id: 4,
            name: 'Frontend-разработчик',
            cities: 'Екатеринбург',
            annotation: '<p>Если у тебя есть опыт в разработке интерфейсов, ты не боишься кроссбраузерности, и готов создавать продукты, которыми будут пользоваться по всей России, то тебе точно к нам!</p>',
            text: '<p>Если у тебя есть опыт в разработке интерфейсов, ты не боишься кроссбраузерности, и готов создавать продукты, которыми будут пользоваться по всей России, то тебе точно к нам.</p><p>Вместе мы можем перевернуть мир!</p><h3>Ты нам подходишь, если:</h3><ul><li>Имеешь опыт разработки приложений на JS.</li><li>Обладаешь знаниями основных паттернов проектирования.</li><li>Работаешь в одном или нескольких актуальных фреймворках (Angular, Ember, React).</li><li>В основных проектах мы используем AngularJS (мигрируем на Angular), но если ты знаешь Ember или React, нам всё равно есть о чем поговорить. Webpack для сборки, шаблонизатор Jade, Stylus для стилей. Ещё используем babel, чтобы наслаждаться фичами ES2015. А также RollupJS, TypeScript, Karma, Jasmine, Pug. Очень хорошо, если ты работал с чем-то из этого стека, но не критично, если такого опыта не было.</li><li>Умеешь успешно уживаться с кроссбраузерностью. Древние браузеры поддерживать не требуется.</li></ul><h3>Как мы работаем:</h3><ul><li>Работа в команде. Работа в продуктовых командах, которые обладают полной свободой в рамках своего домена (или тематики) и минимумом зависимостей от окружающих.</li><li>Без бюрократии. Нет никаких передач ТЗ между отделами, затягивания сроков и перекладывания ответственности.</li><li>Быстрый результат. Релиз происходит дважды в месяц, и мы сразу получаем реакцию живых пользователей.</li><li>В общем, мы не совсем банк, и работа в Точке — это скорее работа в продуктовой IT-компании, чем в серьёзном финансовом учреждении.</li></ul><h3>От нас:</h3><ul><li>Любое железо для работы. Хочешь последний Макбук Про — дадим тебе последний Макбук Про.<li>Возможность попробовать себя в любой из наших продуктовых команд — от инфраструктуры и оценки рисков до расчёта налогов и внешнеэкономической деятельности.</li><li>Работа над действительно востребованным продуктом: десятки тысяч предпринимателей по всей стране будут использовать то, что ты сделал.</li><li>Уютный офис в центре Екатеринбурга в 5 минутах от метро «Геологическая».</li><li>Кальянная, бесплатные кофе-поинты, пинг-понг, дартс и многое другое.</li><li>Комфортная зарплата, которая оправдывает ожидания. Обсуждается индивидуально.</li></ul>'
          },
          {
            id: 5,
            name: 'Product owner',
            cities: 'Екатеринбург, Казань, Новосибирск',
            annotation: '<p>Открываем вакансию, чтобы найти уникального человека для развития новых продуктов и сервисов. Почему мы ищем Product owner? Сейчас есть много идей и гипотез, которые помогут Точке стать ещё лучше, а наших клиентов сделают счастливее. Чтобы проработать эти гипотезы и в будущем сделать новый, уникальный продукт, ищем единомышленников.</p>',
            text: '<p>Открываем вакансию, чтобы найти уникального человека для развития новых продуктов и сервисов. Почему мы ищем Product owner? Сейчас есть много идей и гипотез, которые помогут Точке стать ещё лучше, а наших клиентов сделают счастливее. Чтобы проработать эти гипотезы и в будущем сделать новый, уникальный продукт, ищем единомышленников.</p><h3>Мы ждем, что человек возьмёт на себя ответственность за:</h3><ul><li>Рост и развитие нового продукта в Точке.</li><li>Работу с продуктовой командой.</li><li>Формирование и приоритизацию бэклога.</li><li>Валидацию продуктовых гипотез.</li><li>Управление ожиданиями стейкхолдеров.</li><li>Синхронизацию видения продукта с другими командами кластера.</li></ul><h3>Успешный кандидат должен иметь:</h3><ul><li>Опыт работы в роли владельца продукта/предпринимателя от 1 года. Плюсом будет наличие кейсов в личном портфолио.</li><li>Идеально, если был опыт работы над собственным стартапом.</li><li>Предпринимательские навыки.</li><li>Драйвить и зажигать команду и людей, с которыми работает.</li><li>Проактивную жизненную позицию.</li><li>Понимание роли владельца продукта и основные инструменты и принципы продуктовой разработки.</li><li>Опыт работы со стейкхолдерами топ-уровня компании.</li></ul><h3>От нас:</h3><ul><li>Теплая и дружественная атмосфера в команде, ты будешь работать с признанными профи.</li><li>Постоянное внешнее и внутреннее обучение за счёт компании.</li><li>Используем лучшие практики разработки ПО: agile, автоматизация процесса, непрерывная интеграция.</li><li>Масштабные задачи: сотни тысяч предпринимателей по всей стране будут использовать твои разработки.</li><li>Уютная комната отдыха, настольный футбол, аркадный автомат, кофе поинты и кальянные.</li><li>Все радости предусмотренные трудовым законодательством, а также медицинская страховка и компенсация обедов.</li><li>График работы 5/2 – начало и окончание рабочего дня – гибкое.</li><li>Уютный офис в центре города в 5 минутах от метро.</li><li>Комфортная зарплата, которая оправдывает ожидания.</li></ul>'
          }
        ]
      }
    },

    created() {
      const vacancy = this.findById(this.$route.params.item);

      if (_.isEmpty(vacancy)) {
        this.$root.error({statusCode: 404});
      }

      this.vacancy = {
        id: vacancy.id,
        name: vacancy.name,
        cities: vacancy.cities,
        annotation: vacancy.annotation,
        text: vacancy.text
      }
    },

    methods: {
      findById(id) {
        let key = _.findKey(this.vacancies, function(item) { return item.id == id; });
        return (key == undefined) ? {} : this.vacancies[key];
      }
    }
  }
</script>